In [1]:

import pandas as pd
df = pd.read_csv('exercise_data.csv')
df.head()

   Unnamed: 0  age  awesome_score  num_hairs       name
0           0   86       0.696960     131717   Marcelle
1           1   86       0.112051     185038    Darlene
2           2   82            NaN     173644    Matilde
3           3   88       1.062127     161278  Marchelle
4           4   81       1.414369      84891      Jessy

In [2]:
df.describe() #describes only numerical data

        Unnamed: 0           age  awesome_score      num_hairs
count  10000.00000  10000.000000    9022.000000   10000.000000
mean    4999.50000     59.153600            inf  112643.095600
std     2886.89568     24.023541            NaN   55812.533345
min        0.00000     18.000000      -1.999581     -50.000000
25%     2499.75000     38.000000      -0.964891   75664.750000
50%     4999.50000     60.000000       0.035636  117213.000000
75%     7499.25000     80.000000       1.016753  159127.250000
max     9999.00000    100.000000            inf  199998.000000

In [3]:
df.info() #describes all data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     10000 non-null  int64
 1   age            10000 non-null  int64
 2   awesome_score  9022 non-null   float64
 3   num_hairs      10000 non-null  int64
 4   name           9998 non-null   object
dtypes: float64(1), int64(3), object(1)
memory usage: 390.8+ KB

In [4]:
df['age'].unique()
df['age'] = pd.to_numeric(df['age'], errors = 'coerce')

In [5]:
df['age'].unique() #we need to probably do this a different way

array([ 86,  82,  88,  81,  44,  49,  74,  77,  28,  37,  91,  53,  95,
        51,  90,  31,  73,  42,  27,  46,  84,  70,  25,  55,  79,  47,
        57,  21,  34,  48,  87,  24,  78,  99, 100,  52,  45,  35,  80,
        26,  85,  76,  67,  63,  40,  65,  22,  33,  39,  20,  60,  36,
        23,  61,  59,  69,  29,  97,  56,  32,  94,  58,  54,  68,  75,
        93,  30,  50,  71,  83,  66,  43,  89,  92,  62,  98,  64,  72,
        41,  96,  19,  18,  38])

In [7]:
df['awesome_score'].describe()

count    9022.000000
mean             inf
std              NaN
min        -1.999581
25%        -0.964891
50%         0.035636
75%         1.016753
max              inf
Name: awesome_score, dtype: float64

In [8]:
import numpy as np
df['awesome_score'].replace([np.inf, -np.inf], np.nan, inplace = True) #replace infinite values
df.describe()

        Unnamed: 0           age  awesome_score      num_hairs
count  10000.00000  10000.000000    9012.000000   10000.000000
mean    4999.50000     59.153600       0.020502  112643.095600
std     2886.89568     24.023541       1.149271   55812.533345
min        0.00000     18.000000      -1.999581     -50.000000
25%     2499.75000     38.000000      -0.965704   75664.750000
50%     4999.50000     60.000000       0.033622  117213.000000
75%     7499.25000     80.000000       1.014523  159127.250000
max     9999.00000    100.000000       1.999713  199998.000000

In [9]:
df['name'].unique()

array(['Marcelle', 'Darlene', 'Matilde', ..., 'Bette', 'Gaylene',
       'Vivian'], dtype=object)

In [10]:
df['name'].replace('99999', np.nan, inplace = True)
df['name'].unique()

array(['Marcelle', 'Darlene', 'Matilde', ..., 'Bette', 'Gaylene',
       'Vivian'], dtype=object)

In [12]:

merger_df = pd.read_csv('merge_exercise.csv')
#print(merger_df.shape)
new_df = df.merge(merger_df, on = 'name') #on value is column that you merge on
new_df.head()

,Unnamed: 0_x,age,awesome_score,num_hairs,name,Unnamed: 0_y,num_apples
0,22,86,-0.672030,119386,Nadia,168,297
1,3469,75,0.700926,-50,Nadia,168,297
2,6752,49,1.625382,-50,Nadia,168,297
3,9721,23,-0.169875,72983,Nadia,168,297
4,129,58,1.000758,78137,Juline,3,121